# ParentKey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntry..::..ParentKey Property
KeyBasedTreeEntry Class See Also
---
The parent key of this entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string ParentKey { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ParentKey As String
	Get
```

Visual C++
---
```text
public:
property String^ ParentKey {
	String^ get ();
}
```

# Remarks
This value will be the empty string if this entry does not have a parent.
# See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace